{
    "B44": "The Sicilian Defence is the most popular and best-scoring response to White's first move 1.e4. 17% of all games between grandmasters begin with the Sicilian. Black's most common move after 2.Nf3 is 2...d6 which prepares ...Nf6 to attack the e-pawn without letting White push it to e5. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. The Sveshnikov Variation is less tactical than many of the other Sicilian variations, and play involves much strategic maneuvering on both sides. Black avoids playing ...d7–d6 and can later play ...d 7–d5 in one move if possible. The critical test of Black's move order is 5.c4. The Sicilian Defence is one of the most popular openings in chess. It is named after the Sicilian town of Sveshnikov. Black's best reply is 2...d5 3.exd5 Nf6!, the Tal Gambit. Black has a choice between 5...e6 and 5...Nc6. 2.e5 is considered dubious as it gives Black a comfortable position after 3.Qxc5 Nxe4. Wilhelm Steinitz played it at least three times in tournament play. The Sicilian defence is a variation of the Honeysuckle Defence. There are several other Sicilian openings, including the Najdorf Variation and the Alapin Variation. The 2.Na3 is an eccentric move recently returned to prominence by GM Vadim Zvjaginsev.",
    "D12": "The Slav Defense is one of the primary defenses to the Queen's Gambit. The theory of the Slav is very extensive and well-developed. There are three main variations: the \"Pure\" Slav, the \"Main Line Slav\" and the \"Semi-Slav\" The main line is 3...Nf6 when 4.Nf3 transposes to the main line. Black can try the Winawer Countergambit, 3...e5, which was introduced in Marshall–Winawer, Monte Carlo 1901 but this is thought to be slightly better for White. 5.e3 is a solid choice known as the Alekhine Variation. Play can proceed 5...b5 6.a4 b47.Na2 e6 8.Bxc47.Nb1 Ba6. 8.Nbd2 c3 9.bxc3 Bxf1 10.Nxf1 bxc3. Black's main move is 5...Bf5.",
    "B88": "The Sicilian Defence is one of the most popular openings in chess. It is used by most grandmasters to defend against the opening 1.e4. Black's most common move after 2.Nf3 is 2...d6 which prepares ...Nf6 to attack the e-pawn without letting White push it. The Sveshnikov Variation was pioneered by Evgeny SvesHnikov and Gennadi Timoshchenko in the 1970s. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. The game becomes a race between White's kingside attack and Black's queenside counterattack. The Sicilian Defence is one of the most popular openings in chess. It is based on the Sicilian Opening. The Sicilian Variation is the third most popular opening in the world. The opening is named after the town of Sicilian. Wilhelm Steinitz played 2.e4 at least three times in tournament play. 2.Na3 is an eccentric move recently returned to prominence by GM Vadim Zvjaginsev. The modern main line runs 2.Nc3 Nc6 3.f4 g6 4.Nf3 Bg7. The reply is 2...d5 3.exd5 Nf6!, the Tal Gambit. The game is played on the famous Sicilian board.",
    "D15": "The Slav Defense is one of the primary defenses to the Queen's Gambit. The theory of the Slav is very extensive and well-developed. Black often chooses the order 2...e6 followed by 3...c6 to avoid the possibility of the Exchange Variation. The \"Pure\" Slav Opening is played with 3...Nf6, 4.Nc3, 4...e3 or 4.e4. Black can try the Winawer Countergambit, 3...e5, which was introduced in Marshall–Winawer, Monte Carlo 1901 but this is thought to be slightly better for White. White can also try the following alternatives. 5.e3 is a solid choice known as the Alekhine Variation. Play usually continues 5...b5 6.e5 Nd5 7.a4 e6, but it is unclear whether the attack is strong enough for the sacrificed pawn. Black's main move is 5...Bf5.",
    "B43": "The Sicilian Defence is a chess opening that begins with the following moves: 1.e4 c5. It is the most popular and best-scoring response to White's first move 1.d4. Bobby Fischer and Garry Kasparov are two of the most famous players to have played the Sicilian. The Sicilian was not seen even once in the 75 games played at the great St. Petersburg 1914 tournament. Black's best reply is 2...Nf62 ...Nf6, while White's strongest reply is to chase the knight by 3.e5 Nd5. White can play 2.Nf3 without intending to follow up with 3. d4. Black can also use the Sveshnikov Variation. The Sicilian Defence is one of the most popular openings in chess. It is named after the city of Sicilian, a city in southern Russia. The Sicilian Variation is considered to be the most difficult of the three Sicilian openings. The opening is also considered too reckless, and rarely seen in grandmaster praxis. Theopening is also known as the 'Sicilian Defence' or 'The Sicilian Defence' It is also called 'the Sicilians Defence' and 'the Italian Defence' by some chess players. The game is played on the Sicilian board, which is known as a 'sicilian square' or a ' Sicilian Gambit' The opening can also be played on a Sicilian hexagon, which can be played by a Siciliano player on a hexagon.",
    "B81": "The Sicilian Defence is the most popular and best-scoring response to White's first move 1.e4. It was developed in the 1930s by Isaac Boleslavsky, Alexander Kotov, and Miguel Najdorf. Bobby Fischer and Garry Kasparov used it almost exclusively throughout their careers. It fell out of favour when some of the world's leading players rejected it. Black's best reply is 2...d5 or 2...c3. Black has three main moves: 4...Nc6 (the Taimanov Variation), 4...a6 ( the Kan Variation) and 4 ...Nf6. The Four Knights Variation is mainly used as a way of getting into the main line Sveshnikov Variation. The Sicilian Defence is one of the most popular openings in chess. The opening is named after the city of Sicilian. White often supports the e5-pawn with 3.f4 or 3.Nf3. The Sicilian defence is based on the Sicilian Opening. There are also Sicilian Variations, including t and f4 g6. The move 2.Na3 is an eccentric move recently returned to prominence by GM Vadim Zvjaginsev. It allows White to gain space and prevents Black playing ...Nf6. It is used to support the e4-Pawn in the opening 2.e5-e5. It can also be used to protect the e6-P pawn in the Sicillian Defence.",
    "B75": "The Sicilian Defence is the most popular and best-scoring response to White's first move 1.e4. Black's most common move after 2.Nf3 is 2...d6 which prepares ...Nf6 to attack the e-pawn without letting White push it to e5. Black can then choose between four major variations: the Najdorf, Dragon, Classical and Scheveningen. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. The Sveshnikov Variation has become very popular in master level chess. Top players who have used this variation include Magnus Carlsen, Vladimir Kramnik, Veselin Topalov and Teimour Radjabov. The Sicilian Defence is one of the most popular openings in chess. The opening is named after the city of Sicilian. Wilhelm Steinitz played it at least three times in tournament play. Vadim Zvjaginsev used it three times during the 2005 Russian Chess Championship Superfinal. The Sicilian defence is also known as the Tal Gambit Declined or the Najdorf Variation. It is considered to be the most difficult of the chess openings. The most reasonable moves include: 2.e5, 2.Ne2 and 2. Ne3. The Keres Variation is a favourite of Paul Keres and is played with two e5s. It does not bring pressure to the centre and is considered dubious.",
    "D23": "The Queen's Gambit Accepted is a chess opening characterised by the moves:1. d4 d52. c4 dxc4. It is the third most popular option on Black's second move, after 2...e6 and 2...c6 (the Slav Defense) It is not considered a true gambit, because the pawn is either regained or held unprofitably by Black. 3.e4 is an old move that became popular again in the 1990s. The Alekhine Variation is an uncommon line that focuses on rapid development of pieces and domination of the centre. The old main line 7.Qe2 allows ...b5, and theory holds that Black can equalise against it. Trying to protect the pawn with 3...b5 is fairly risky and rarely seen. 3. Nc3 was recommended by Keene and Jacobs in their opening repertoire for White. The queen check by 3.Qa4+ Nc6 4.Nf3 will quickly regain the pawn with Qxc4, but the early development of the queen allows Black to win time by harassing it.",
    "D24": "The Queen's Gambit Accepted is the third most popular option on Black's second move, after 2...e6 and 2...c6. It is not considered a true gambit, because the pawn is either regained, or can only be held unprofitably by Black. The opening was mentioned in literature as early as the 15th century. Wilhelm Steinitz and Johannes Zukertort introduced the first modern ideas in this opening in 1886. 6.Qe2, called the Furman Variation after Semion Furman, is a major alternative to castling. The Alekhine Variation is an uncommon line that focuses on rapid development of pieces along with domination of the centre. White can try to establish a strong pawn centre with 3.e4. 3. Nc3 was recommended by Keene and Jacobs in their opening repertoire for White. The queen check by 3.Qa4+ Nc6 4.Nf3 will quickly regain the pawn with Qxc4, but the early development of the queen allows Black to win time by harassing it.",
    "B72": "The Sicilian Defence is the most popular and best-scoring response to White's first move 1.e4. It is named after Giulio Cesare Polerio, who wrote about it in 1594. Black's most common move after 2.Nf3 is 2...d6 which prepares ...Nf6 to attack the e-pawn without letting White push it to e5. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. Black has three main moves: 4...Nc6, 4...a6 (the Kan Variation) and 4...nf6. The Sicilian Defence is one of the most popular openings in chess. The opening is named after the city of Sicilian. The Sicilian defence is also known as the \"Easiest Sicilian\" or the \"Sicilian Variation\" It is the third most popular  defence in the world. Black may decline the gambit with 3.Nc3, called the \"Toilet Variation\", so named after its reputed place of invention. 2.e5 is considered dubious as it prevents Black playing ...Nf6. The Tal Gambit is 2...d5 3.exd5 Nf6!, which has caused the immediate 2.f4 to decline in popularity. Wilhelm Steinitz played it at least three times in tournament play.",
    "B86": "The Sicilian Defence is a chess opening that begins with the following moves:1. e4 c5. It is the most popular and best-scoring response to White's first move 1.e4. Black's most common move after 2.Nf3 is 2...d6 to attack the e-pawn without letting White push it to e5. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. The Sveshnikov Variation has become very popular in master level chess. The move 4...e5 has had a long history; Louis-Charles Mahé de La Bourdonnais used it in matches against Alexander McDonnell in 1834. 2.e5 is considered dubious as it gives Black a comfortable position after 3.Qxc5 Nxe4. 2.Na3 is an eccentric move recently returned to prominence by GM Vadim Zvjaginsev. Hikaru Nakamura lost in 23 moves to Andrei Volokitin in 2005. Modern players would consider the notion that the Sicilian \"prevents every attack\" naive. The Najdorf Variation is one of the most populaire moves in the game. The Grand International Masters' Tournament at St. Petersburg 1914, David McKay, c. 1915, p. 75, is a classic example of a Sicilian Variation. It is played with the following moves: f4 g6 4.Nf3 Bg7.",
    "D70": "The Grünfeld Defence is a chess opening characterised by the moves:1. d4 Nf62. c4 g63. Nc3 d5. Black offers White the possibility of 4.cxd5, which may be followed by 4...Nxd5 and 5.e4. If White does not take the d5-pawn, Black may eventually play ...dxc4, when a White response of e4 again leads to the same pawn structure. In classical opening theory this imposing pawn centre was held to give White a large advantage, but the hypermodern school of chess held that a large pawn centre could be a liability rather than an asset. White can develop their pieces in a number of ways in the Exchange Variation. For decades, theory held that the correct method of  development was with Bc4 and Ne2, often followed by 0-0 and f4–f5, playing for a central breakthrough or kingside attack. In the late 1970s, however, Karpov, Kasparov and others found different methods to play the Exchangevariation with White. The Grünfeld Gambit is not often met in top-flight play today, its usage having declined significantly since its heyday in the 1930s. In statistical databases this variation shows only a slightly higher percentage of White wins and draws, as opposed to the Exchange Variation. Chessgames: Neo-Grünfeld 3.f3 is a 3.g3 version of the classic game. The game is based on the game of chess. It is available in English, German, and Hebrew. It was first published in 1953.",
    "B26": "The Sicilian Defence is one of the most popular openings in chess. It is used by world champions Bobby Fischer and Garry Kasparov. Black has three main options after 1.e4: 2...d6, 2...Nc6, and 2...e6. After 2.Nf3 there are four major variations: Najdorf, Dragon, Classical and Scheveningen. Black's best reply is 3exd5 N6!, the Talbit Gambit, which has caused the immediate decline in popularity of the Sicilian. The Sicilian was not seen even once in the 75 games played at the great St. Petersburg 1914 tournament. It fell out of favour when some of the world's leading players rejected it. The Sicilian Defence is one of the most popular chess openings. It is named after the Sicilian city of Sveshnikov. The Wayward Queen Attack, was played twice in 2005 by Hikaru Nakamura, but the move is considered dubious. The Sicilian defence is based on the idea that every attack should be countered with a Sicilian opening. There are several othe openings that can be used to counter an opponent's Sicilian attack, such as the Elaborate Defence and the Pawn Defence. The opening is also known as the King's Defence or the Queen's Defence, and was used by Bobby Fischer and Garry Kasparov in the 1980s and 1990s. It was first used in the game of chess in the early 1900s.",
    "D84": "The Grünfeld Defence is a chess opening characterised by the moves:1. d4 Nf62. c4 g63. Nc3 d5. Black offers White the possibility of 4.cxd5, which may be followed by 4...Nxd5 and 5.e4, giving White an imposing central pawn duo. In classical opening theory this imposing pawn centre was held to give White a large advantage, but the hypermodern school, which was coming to the fore in the 1920s, held that a large pawn centre could be a liability rather than an asset. Garry Kasparov often used the defence in his World Championship matches against Anatoly Karpov. White can develop their pieces in a number of ways in the Exchange Variation. For decades, theory held that the correct method of  development was with Bc4 and Ne2, often followed by 0-0 and f4–f5, playing for a central breakthrough or kingside attack. In the late 1970s, however, Karpov, Kasparov and others found different methods. The Grünfeld Gambit is a variation of the Exchange Variation. The variation is not often met in top-flight play today, its usage having declined significantly since its heyday in the 1930s. White can accept the gambit by playing 6.cxd5 Nxd5 7.Nxd5 Qxd5 8.Bxc7, or decline it with 6.Qb3 or 6.Rc1. Chessgames: Neo-Grünfeld 3.f3 is a version of the classic game 3.g3. The game is played on the board of a grand prix-style chessboard. The rules are similar to those used in the classic version of chess.",
    "B19": "The Caro–Kann Defence is a chess opening characterised by the moves:1.e4 c6 2.d4 d5 3.Nc3 (or 3.d2) 4.Nxe4 Bf5. The opening is named after Horatio Caro and Marcus Kann, both of whom analysed it in 1886. The Classical Variation is characterised by the moves: 1.e4 c6 2.d4 d5 3.Nc3 dxe4 4.Nxe4 Nd7. At one time named after the first world champion Wilhelm Steinitz, nowadays the variation is variously referred to as the Smyslov Variation after the seventh world champion Vasily Smyslav. The Karpov Variation, after the twelfth world champion Anatoly Karpovsky, appeared quite often. The Gurgenidze Variation is 1.e4 c6 2.d4 d5 3.Nc3 g6. The 3...Bf5 variation has gained popularity after having been widely regarded as inferior for many years. Black's 5...exf6 is regarded as sounder than 5...gxf6!? of the Bronstein–Larsen Variation. The Fantasy Variation, formerly known as the Tartakower or Maroçzy variation, 1.e4 c6 2.d4 d5 3.f3, somewhat resembles the Blackmar–Diemer Gambit. The Two Knights Variation was played by Bobby Fischer in his youth but has since declined in popularity. The Hillbilly Attack is most often played by weaker players unfamiliar with the Caro–Kann Defence. The Apocalypse Attack is sometimes referred to as the Apocalypse Attack. Other lines include 2.d3, the Breyer Variation, the Euwe Attack, 2.b3, and the Labahn Attack. Bronstein–Larsen Variation: 1.e4 c6 2.d4 d5 3.Nc3 g6 4.e5 Bg7 5.f4 h5Campomanes Attack: 1, e4, c6, d4, d5, Nc3, Nf6, Nxf6, exf6. Spassky Variation with 7...Nd7. Steinitz Variation.",
    "D83": "The Grünfeld Defence is a chess opening characterised by the moves:1. d4 Nf62. c4 g63. Nc3 d5. Black offers White the possibility of 4.cxd5, which may be followed by 4...Nxd5 and 5.e4. If White does not take the d5-pawn, Black may eventually play ...dxc4. Garry Kasparov often used the defence, including in his World Championship matches against Anatoly Karpov in 1986, 1987 and 1990, and Vladimir Kramnik in 2000. White can develop their pieces in a number of ways in the Exchange Variation. For decades, theory held that the correct method of  development was with Bc4 and Ne2, often followed by 0-0 and f4–f5. In the late 1970s, however, Karpov, Kasparov and others found different methods to play the exchange. The Grünfeld Gambit is a variation of the Exchange Variation. It is not often met in top-flight play today, its usage having declined significantly since its heyday in the 1930s. Systems in which White delays the development Nc3 are known as the Neo-Grünfield Defence. Chessgames: Neo-Grünfeld 3.f3 is a version of 3.g3. The game is based on the famous game of the same name. It is played with the rules of the 3. f3 and 3. g3 games.",
    "B21": "The Sicilian Defence is the most popular and best-scoring response to White's first move 1.e4. It is named after Giulio Cesare Polerio, who wrote about it in 1594. Black's most common move after 2.Nf3 is 2...d6 to attack the e-pawn without letting White push it to e5. White's intention with 5...a6 was to prepare ...e5 on the next move to gain space in the centre. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. The Sveshnikov Variation was pioneered by Evgeny SvesHnikov and Gennadi Timoshchenko in the 1970s. The Sicilian Defence is one of the most popular openings in chess. It is based on the idea that the Sicilian \"prevents every attack\" Modern players would consider this notion naive. The Sicilian defence is also known as the Tal Gambit Declined or t.Na3. The move has been returned to prominence by GM Vadim Zvjaginsev. It has been used more than 2,000 times in tournament play in recent years. The game is currently being played on the FIVEth anniversary of the start of the World Chess Championship in Berlin. The match will be broadcast live on BBC One at 8pm BST on Sunday, September 14. The event will also be broadcast on BBC Two at 10pm on Monday, September 15.",
    "D77": "",
    "D48": "Semi-Slav Defense is a variation of the Queen's Gambit Declined chess opening. It is defined by the position reached after the moves:1. d4 d52. c4 c63. Nf3 Nf64. Nc3 e6. After 3.Nf3 Nf6 White has the option of entering the Catalan opening with 4.g3. Black has the opportunity to respond with 3...e6 instead of 3...Nf6. White now has a number of possible continuations, including 5.a4 (see below) The Meran is a chess variation that was first played in 1906 in Schlechter–Perlis. The variation takes its name from the town of Meran (Merano) in northern Italy. White will play in the center, leading to a rich, complicated game. Black's main plan, on the other hand, is to find a way to push ...c6–c5. The modern version of the Meran is played after 8...Bb7. The idea behind this move is to develop the light-squared bishop and possibly play b5–b4 and c6–c5 without wasting time on a7–a6. The move was long considered virtually unplayable due to the line 9.e4 b4. The game becomes wildly tactical and provides opportunities for both sides. White's strategic idea in the Meran is to push e3–e4, and with a bishop on d6 Black is always ready to meet this with e6–e5. Black commonly replies with 6...Bd6. White can choose between a couple of very different continuations. The Anti-Meran Gambit is a variation of the Queen's Gambit. It has been used by several grandmasters, including Kasparov, who won the first game of his 2003 match against the computer chess program Deep Junior with it. Moscow Variation 5...h6 6.Bxf6 Qxf6 gives rise to play of a very different character from the Botvinnik or Anti-Moscow Variations. Black aims to benefit from the slight dark square weaknesses left behind on the queenside after the bishop has moved outside the pawn chain. The Botvinnik Variation is probably one of the most complicated of all chess openings, with theory stretching past move thirty in some variations. The opening was introduced by Mikhail Botvinik in the 1945 USSR vs. USA radio match vs. Arnold Denker. The Botvinnik Variation is one of the most difficult variations of the Queen's Gambit Declined. The main continuation is 11...Bb7 12.Bg2 Qb6 13.exf6 0-0-0 14.0- 0 c5 (14...Ne5 is also an option): White can simply capture 15.dxe5, and while Black wins the queen after 15...Rxd1 16.Raxd1, White seems to have the upper hand at least according to engines. The most challenging continuation is 16.Na4, where Black has two main replies: 16...Qa6 and 16...Na4. After 5.g3, White makes a claim that he's ready to play the Catalan, with the black pawn a bit passively on c6. This practically forces Black to take the c-pawn with 5...dxc4. White will continue 6.Bg2 (6.a4 c5 is supposed to be good for Black), and Black has now two main choices. First, he can play 6...b5, and the game might continue in Catalan style with 7.Ne5 a6 8.A4 (8.Nxc6 Qb6 is fine for Black) Bb7 and so on. After 7.Qd3, Black's best reply is considered to be 7...a68.e4 c4 or 9.e5.",
    "D41": "The Queen's Gambit Declined is a chess opening in which Black declines a pawn offered by White. The Orthodox Line is usually assumed to be referring to the Orthodox Line; see \"Other lines\" below. Black erects a solid position by declining White's temporary pawn sacrifice. It is one of Black's most reliable defenses to 1.d4. White has several ways of dealing with Black's setup. The Cambridge Springs Defense was introduced more than a century ago, and is still popular among amateurs. Black can fall into several traps, for example, the Elephant Trap. White has alternatives to 4.Nf3 such as the Marshall Gambit 4.e4 and the Stonewall Dutch after ...f5. The Three Knights Variation of the Queen's Gambit Declined is usually reached from the move order 1.d4 Nf6 2.c4 e6 3.Nf3 d5 4.Nc3, played to avoid the Nimzo-Indian Defense. The Vienna Variation occurs after Black plays 4...dxc4 in the Three Knight's Variation. Placing the bishop on Bg5 allows Black to exchange more freely with moves like Nf6-e4. The move Bf4 is designed to restrict Black's opportunities in this way. Play usually continues with 5...0-0 6.e3 c5 7.dxc5 Bxc5. Peter Leko used this variation as White to beat Vladimir Kramnik in their 2004 World Championship Match.",
    "B17": "The Caro–Kann Defence is a chess opening characterised by the moves:1.e4 c6 2.d4 d5 3.Nc3 (or 3.d2) 4.Nxe4 Bf5. The opening is named after Horatio Caro and Marcus Kann, both of whom analysed it in 1886. The Classical Variation is one of the most popular. More popular recently are variations with Black castling kingside and even leaving his king in the centre. These variations can be sharp and dynamic. The famous last game of the Deep Blue versus Garry Kasparov rematch was played in this very line. The Gurgenidze Variation is 1.e4 c6 2.d4 d5 3.Nc3 g6. Black prepares to fianchetto the bishop on g7, creating pressure against White's d4-pawn. After 4.Nf3 Bg7 White usually plays 5.h3 to prevent the ...Bg4 pin. Black's 5...exf6 is regarded as sounder than 5...gxf6!? of the Bronstein–Larsen Variation. The Fantasy Variation, formerly known as the Tartakower or Maroçzy variation, 1.e4 c6 2.d4 d5 3.f3, somewhat resembles the Blackmar–Diemer Gambit. The Two Knights Variation was played by Bobby Fischer in his youth, but has since declined in popularity. The Hillbilly Attack is most often played by weaker players unfamiliar with the Caro–Kann Defence. The Apocalypse Attack is sometimes referred to as the Apocalypse Attack. Other lines are ineffective or doubtful. The worst response by white to the Cara-Kann defence is g3. White's response to the defence can keep win/loss/draw chances or increase draw chances. The Caro-Kann Defence is one of the most popular chess openings in the world. The opening is named after Caro Kann, the founder of chess. There are several variations on the opening, including the Bronstein–Larsen Variation and the Steinitz Variation.",
    "B28": "The Sicilian Defence is the most popular and best-scoring response to White's first move 1.e4. It is used to counter the opening of 1.d4. About 80% of Master-level games begin with 2.Nf3, after which there are three options for Black: 2...d6, 2...Nc6, and 2...e6. The Sveshnikov Variation was pioneered by Evgeny SvesHnikov and Gennadi Timoshchenko [ru] in the 1970s. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. The Sicilian Defence is one of the most popular openings in chess. The opening is named after the city of Sicilian, where the tournamnet is held. Wilhelm Steinitz played it at least three times in tournament play. White may decline the gambit with 3.Nc3, called the \"Toilet Variation\" so named after its reputed place of invention. 2.e5 is considered dubious as it does not bring pressure to the centre. The 2.Na3 is an eccentric move recently returned to prominence by GM Vadim Zvjaginsev. The Sicilian defence is based on the 1.e4 Sicilian Variation.  caused the immediate 2.f4 to decline in popularity.",
    "B10": "The Caro–Kann Defence is a chess opening characterised by the moves:1.e4 c6 2.d4 d5 3.Nc3 (or 3.d2) 4.Nxe4 Bf5. It is named after Horatio Caro and Marcus Kann, both of whom analysed it in 1886.  Classical Variation: 1. e4 c6 2. d4 d5 3. Nc3 dxe4 4. Nxe4 Bf5 5. Ng3 Bg6 6. h4 h6 7. Nf3 Nd7 8. h5 Bh7 9. Bd3 Bxd3 10. Qxd3 e6 (10...Qc7 avoids White's next) 11. Bf4 Bb4+ 12. c3 Be7 13. 0-0-0 Ngf6 14. Kb1 0-1 15. Ne5 c5?! (15...Qa5 is usual and better) 16. Qf3 Qb6? (necessary was 16...cxd4 17.Rxd4 Nxe5 18.Bxe5 Qc8 19.Rhd1 Rd8 20.Ne4 with a small White advantage) 17. Nxd7 Nxc7 18. The Gurgenidze Variation is 1.e4 c6 2.d4 d5 3.Nc3 g6. Black prepares to fianchetto the bishop on g7, creating pressure against White's d4-pawn. Black's 5...exf6 is regarded as sounder than 5...gxf6!? of the Bronstein–Larsen Variation. The Fantasy Variation, formerly known as the Tartakower or Maroçzy variation, 1.e4 c6 2.d4 d5 3.f3, somewhat resembles the Blackmar–Diemer Gambit. The Two Knights Variation was played by Bobby Fischer in his youth, but has since declined in popularity. The Hillbilly Attack is most often played by weaker players unfamiliar with the Caro–Kann Defence. Other lines include 2.d3, the Breyer Variation, the Euwe Attack, 2.b3, and the Labahn Attack. The worst response by white to the Cara-Kann defence is g3. The Caro-Kann Defence is one of the most popular chess openings. It is named after the famous American chess grandmaster, Caro Kann. There are many variations on the opening, including the Bronstein–Larsen Variation and the Steinitz Variation.",
    "D46": "Semi-Slav Defense is a variation of the Queen's Gambit Declined chess opening. It is defined by the position reached after the moves:1. d4 d52. c4 c63. Nf3 Nf64. Nc3 e6. After 3.Nf3 Nf6 White has the option of entering the Catalan opening with 4.g3. Black has the opportunity to respond with 3...e6 instead of 3...Nf6. White now has a number of possible continuations, including 5.a4 (see below) and 5.e3. The Meran is a chess variation first played in 1906 in Schlechter–Perlis. The variation takes its name from the town of Meran (Merano) in northern Italy. White will play in the center, leading to a rich, complicated game. Black's main plan is to find a way to push ...c6–c5. The Meran is a game of chess played with bishops and pawns. Black typically develops his queen with ...Qc7, with the choice of whether or not to push the c-pawn to c4. White has the option of playing 10.d5, which often transposes to the Reynolds Attack (described in detail below) Continuing the game with 9.e4 b4 10.Na4 c5 11.e5 Nd5 is still very much an option for White. Instead of captures on c5, White can play 12.0-0 with some attacking prospects. The most critical continuation is 12...cxd4 after which White can either play 13.Re1 or 13.Nxd4, both giving opportunity for some wild attacks on the black position. White can immediately push 11.e4, and Black must respond with the thematic 11...e5. Black players have tried various approaches to combat White's plan, and the final word on this variation has certainly not yet been said. After 11...Qe7, White can continue 12. e4 e5 13.Bg5, and White seems to retain some advantage. 5...h6 leads to 5...Nbd7 (transposing to the Cambridge Springs Defense), 5...dxc4 (triggering the ultra-sharp Botvinnik Variation) or 5...Be7. Main Black replies are (in order of frequency in high-level games): 5... h6 (immediately questioning the white bishop's intentions, leading to Moscow/Anti-Moscow variations) 5...H6 6.Bxf6 Qxf6 gives rise to play of a very different character from the BotVinnik or Anti-Moscow Variations. Black aims to benefit from slight dark square weaknesses left behind on the queenside after the bishop has moved outside the pawn chain. The Botvinnik Variation is probably one of the most complicated of all chess openings, with theory stretching past move thirty in some variations. The opening was introduced by Mikhail BotVinnik in the 1945 USSR vs. USA radio match vs. Arnold Denker. Black makes the thematic pawn capture 5...dxc4 immediately. The Botvinnik Variation is a variation of the Queen's Gambit Declined. White has two main continuations: 16.Na4 and 16.Rb1. The most challenging continuation is 16...Na4, where Black has two. main replies. Black breaks the pin on the h4–d8 diagonal and forms a pin of his own on the c3-knight. After 5.g3, White makes a claim that he's ready to play the Catalan, with the black pawn a bit passively on c6. This practically forces Black to take the c-pawn with 5...dxc4. After 7.Qb3, the game might continue 7...Nbd7 8.Bg5 Be7 9.e3 with equal opportunities. Black's best reply is considered to be 7...a6 8.e4 c5 and Black is supposed to be fine after either 9.dxc5 or 9. e5.",
    "D79": "",
    "B87": "The Sicilian Defence is the most popular and best-scoring response to White's first move 1.e4. It was developed by Isaac Boleslavsky, Alexander Kotov, and Miguel Najdorf. World champions Bobby Fischer and Garry Kasparov favoured sharp, aggressive play and employed the Sicilian almost exclusively throughout their careers. Black usually plays 6...e6 to limit the range of White's bishop, but White can eventually put pressure on the e6-pawn. The Sveshnikov Variation was pioneered by Evgeny Sveschnikov and Gennadi Timoshchenko in the 1970s. Top players who have used this variation include Magnus Carlsen, Vladimir Kramnik, Veselin Topalov, Teimour Radjabov and Boris Gelfand. The Sicilian Defence is one of the most popular chess openings. It is named after the Sicilian city of Sveshnikov. Wilhelm Steinitz played it at least three times in tournament play. White may decline the gambit with 3.Nc3, called the \"Toilet Variation\" 2.e5 is considered dubious as it does not bring pressure to the centre. 2.Na3 is an eccentric move recently returned to prominence by GM Vadim Zvjaginsev. The Sicilian defence is based on the 1.e4 opening. It can be played in any of the following ways: 1. e4, 2. e5, 3. e6, 4. e7, 5. e8 or 6. e9.",
    "D25": "The Queen's Gambit Accepted is a chess opening characterised by the moves:1. d4 d52. c4 dxc4. It is the third most popular option on Black's second move, after 2...e6 and 2...c6. Black usually allows the pawn to be recaptured and uses the time expended to play against White's centre. White can try to establish a strong pawn centre with 3.e4, an old move that became popular again in the 1990s. The Alekhine Variation focuses on rapid development of pieces along with domination of the centre. The old main line 7.Qe2 allows ...b5, and theory holds that Black can equalise against it. 3. Nc3 was recommended by Keene and Jacobs in their opening repertoire for White. The queen check by 3.Qa4+ Nc6 4.Nf3 will quickly regain the pawn with Qxc4. The early development of the queen allows Black to win time by harassing it.",
    "B73": "The Sicilian Defence is a chess opening that begins with the following moves: 1.e4 c5. It is named after Giulio Cesare Polerio, who wrote about it in 1594. The Sicilian was popular for much of the nineteenth century. It fell out of favour when some of the world's leading players rejected it. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. Black usually plays 6...e6 (ECO B88 transposed) to limit the range of White's bishop. The Sveshnikov Variation has become very popular in master level chess. Top players who have used this variation include Magnus Carlsen, Vladimir Kramnik and Veselin Topalov. The Sicilian Defence is one of the most popular chess openings. The opening is named after the city of Sicilian, Russia. Wilhelm Steinitz played it at least three times in tournament play. Vadim Zvjaginsev used it three times during the 2005 Russian Chess Championship Superfinal. The Sicilian defence is considered to be the most difficult of all chess openings to learn. It is the only one that is not nam. The position after 3.Qxc5 Nxe4 is known as the 'Sicilian Defence' and is considered a difficult one to learn because it is not known as a 'nam' position. The game is played on the basis of the following chess moves: Qxc5, Qxe4, Nxe5, Nxc5 and Nxe6.",
    "B74": "The Sicilian Defence is the most popular opening for Black in modern chess. It is based on the 1.e4 move, and is often followed by 2...d6, 2...Nc6, and 2...e6. Black can then choose between four major variations: the Najdorf, Dragon, Classical, and Scheveningen. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. The Sveshnikov Variation was pioneered by Evgeny SvesHnikov and Gennadi Timoshchenko [ru] in the 1970s. Top players who have used this variation include Magnus Carlsen, Vladimir Kramnik, Veselin Topalov and Teimour Radjabov. The Sicilian Defence is one of the most popular openings in chess. It is based on the idea that the Sicilian \"prevents every attack\" Modern players would consider this notion naive. Wilhelm Steinitz played it at least three times in tournament play. 2.Na3 is an eccentric move recently returned to prominence by GM Vadim Zvjaginsev. Two.e5 is considered dubious as it does not bring pressure to the centre. The Sicilian defence is also known as the  \"Sicilian Defence\" or the \"Sicilian Defence\" It is a variation of the opening played by Magnus Carlsen and Vladimir Kuznetsov. It was invented in the early 20th century by German-born Gottlieb von Dohnanyi.",
    "D22": "The Queen's Gambit Accepted is the third most popular option on Black's second move, after 2...e6 and 2...c6. It is not considered a true gambit, because the pawn is either regained, or can only be held unprofitably by Black. Black usually allows the pawn to be recaptured and uses the time expended to play against White's centre. 3.e4 is an old move that became popular again in the 1990s. The Alekhine Variation is an uncommon line that focuses on rapid development of pieces along with domination of the centre. 3...Nc6 is aimed at challenging the centre with ideas akin to the Chigorin Defense. The old main line 7.Qe2 allows ...b5 and theory holds that Black can equalise against it. 3. Nc3 was recommended by Keene and Jacobs in their opening repertoire for White. The queen check by 3.Qa4+ Nc6 4.Nf3 will quickly regain the pawn with Qxc4, but the early development of the queen allows Black to win time by harassing it.",
    "B80": "The Sicilian Defence is the most popular and best-scoring response to White's first move 1.e4. It is named after Giulio Cesare Polerio, who wrote about it in 1594. The Sicilian was introduced by Jacob Henry Sarratt in 1813. It fell out of favour when some of the world's leading players rejected it. World champions Bobby Fischer and Garry Kasparov favoured the Sicilian. Today, most leading grandmasters include it in their opening repertoire. Black's move 2...e6 gives priority to developing the dark-squared bishop. After 3.d4 cxd4 4.Nxd4, Black has three main moves: 4...Nc6, 4...a6 (the Kan Variation) and 4...nf6. The Sicilian Defence is one of the most popular openings in chess. It is named after the city of Sicilian Sveshnikov in Russia. The Sicilian Variation is considered to be the most difficult opening in the world. There are several variations of the Sicilian, including the Najdorf Variati. 2.Na3 is an eccentric move recently returned to prominence by GM Vadim Zvjaginsev. decline the gambit with 3.Nc3, so named after its reputed place of invention. The 2.e5 is considered dubious because it does not bring pressure to the centre. Wilhelm Steinitz played it at least three times in tournament play. He also used to play it in the World Championship.",
    "B89": "The Sicilian Defence is the most commonly used opening in chess. It is named after Giulio Cesare Polerio, who wrote about it in 1594. The Sicilian was not seen even once in the 75 games played at the great St. Petersburg 1914 tournament. Black's most common move after 2.Nf3 is 2...d6 to attack the e-pawn without letting White push it to e5. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. The Sveshnikov Variation has become very popular in master level chess. Top players who have used this variation include Magnus Carlsen, Vladimir Kramnik, Veselin Topalov and Teimour Radjabov. The Sicilian Variation is considered to be the most difficult of all the chess openings. The opening is named after the city of Sicilian, where the tournament took place in 1914. Nakamura played 2.Qh5 twice in 2005, but the move is considered dubious. It is followed by t in the Sicilian Defence, followed by A in the A-Bay Variation, and then B in the B-Bay Defence, and finally D in the D-Bay Variant, or A-D-E-F. Click here to read more about the Sicillian Variation and other chess moves in the book The Secret of the SIXTH World Chess Championship, published by Simon & Schuster, priced £18.99.",
    "D14": "The Slav Defense is one of the primary defenses to the Queen's Gambit. The theory of the Slav is very extensive and well-developed. There are three main variations: the \"Pure\" Slav, the \"Main Line Slav\" and the \"Semi-Slav Defense\" After 3...Nf6, the main line is 4.Nc3. Black can try the Winawer Countergambit, 3...e5, which was introduced in Marshall–Winawer, Monte Carlo 1901 but this is thought to be slightly better for White. White can also try the following alternatives. 5.e3 is a solid choice known as the Alekhine Variation. Play can proceed 5...b5 6.a4 b47.Na2 e6 8.Bxc47.Nb1 Ba6. 8.Nbd2 c3 9.bxc3 Bxf1 10.Nxf1 bxc3.",
    "B42": "The Sicilian Defence is a chess opening that begins with the following moves: 1. e4 c5. It is named after Giulio Cesare Polerio, who wrote about it in 1594. The Sicilian is Black's most dynamic, asymmetrical reply to 1.e4. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. After 2.Nf3, there are three main options for Black: 2...d6, 2...Nc6, and 2...e6. White has the option of 6.c4—the Maróczy Bind—which solidifies control of d5. The Sicilian Defence is one of the most popular openings in chess. It is named after the Sicilian town of Sveshnikov. There are several variants, including the Najdorf Variation and the   decline in popularity. White may decline the gambit with 3.Nc3, called the \"Toilet Variation\" 2.e5 is an eccentric move recently returned to prominence by GM Vadim Zvjaginsev at the 2005 Russian Chess Championship Superfinal. 2.Qh5, threatening the c-pawn as in the Wayward Queen Attack, was played twice in 2005 by Hikaru Nakamura, but is considered dubious. The Sicilian defence is based on the 1.e4 Sicilian Variation.",
    "B45": "The Sicilian Defence is the most popular response to White's first move 1. e4. It was developed in 1813 by English master Jacob Henry Sarratt. It fell out of favour when some of the world's leading players rejected it. It is used by world champions Bobby Fischer and Garry Kasparov. Black's most common move after 2.Nf3 is 2...d6 to attack the e-pawn without letting White push it to e5. The move 4...e5 has had a long history; Louis-Charles Mahé de La Bourdonnais used it in his matches against Alexander McDonnell in 1834. The entire variation up to 8...b5 is referred to as the Chelyabinsk Variation. It can also be reached from the alternate move order 1.e4 c5. The Sicilian Defence is one of the most popular openings in chess. The opening is named after the city of Sicilian, where the tournament was held in 1915. Wilhelm Steinitz played it at least three times in tournament play. 2.Na3 is an eccentric move recently returned to prominence by Vadim Zvjaginsev.  runs 2.Nc3 Nc6 3. f4 g6 4.Nf3 Bg7 and 2.e5 is considered dubious as it gives Black a comfortable position after 3.Qxc5 Nxe4. The Sicilian defence is also known as the Tal Gambit Declined or th The Tal Gam Bit Declined is a variation of the Sicilian Defense.",
    "D13": "The Slav Defense is one of the primary defenses to the Queen's Gambit. The theory of the Slav is very extensive and well-developed. There are three main variations: the \"Pure\" Slav, the \"Main Line Slav\" and the \"Semi-Slav Defense\" The most common continuation is 3...Nf6 when 4.Nf3 transposes to the main line. Black can try the Winawer Countergambit, 3...e5, which was introduced in Marshall–Winawer, Monte Carlo 1901 but is thought to be slightly better for White. 5.e3 is a solid choice known as the Alekhine Variation. Play usually continues 5...b5 6.e5 Nd5 7.a4 e6, but it is unclear whether the attack is strong enough for the sacrificed pawn. Black's main move is 5...Bf5.",
    "B11": "The Caro–Kann Defence is a chess opening characterised by the moves:1.e4 c6 2.d4 d5 3.Nc3 (or 3.d2) 4.Nxe4 Bf5. It is named after Horatio Caro and Marcus Kann, both of whom analysed it in 1886. The Classical Variation is characterised by the moves: 1.e4 c6 2.d4 d5 3.Nc3 dxe4 4.Nxe4 Nd7. It is also known as the Smyslov Variation or the Karpov Variation. More popular recently are variations with Black castling kingside and even leaving his king in the centre. The Gurgenidze Variation is 1.e4 c6 2.d4 d5 3.Nc3 g6. Black prepares to fianchetto the bishop on g7, creating pressure against White's d4-pawn. After 4.Nf3 Bg7 White usually plays 5.h3 to prevent the ...Bg4 pin. Black's 5...exf6 is regarded as sounder than 5...gxf6!? and offers Black rapid development. The Fantasy Variation, formerly known as the Tartakower or Maroçzy variation, 1.e4 c6 2.d4 d5 3.f3, somewhat resembles the Blackmar–Diemer Gambit. The Two Knights Variation was played by Bobby Fischer in his youth, but has since declined in popularity. The Hillbilly Attack is most often played by weaker players unfamiliar with the Caro–Kann Defence. Black may play 2...e5, the Open Variation (see 1.e4 c6 2.c4 e5). The 2...c4 line can also arise by transposition from the English Opening. The Caro-Kann Defence is one of the most popular chess openings. The opening is named after the inventor of the game. The Caro Kann Defence can be played with any of the following openings: A, B, C, D, E, F, G, H, or J.",
    "D47": "Semi-Slav Defense is a variation of the Queen's Gambit Declined chess opening. It is defined by the position reached after the moves:1. d4 d52. c4 c63. Nf3 Nf64. Nc3 e6. After 3.Nf3 Nf6 White has the option of entering the Catalan opening with 4.g3. Black can play 3...Nf6, which gives White the opportunity to continue 4.cxd5 exd5 followed by 5.Bg5. White now has a number of possible continuations, including 5.a4 (see below) The Meran is a chess variation first played in 1906 in Schlechter–Perlis. The variation takes its name from the town of Meran (Merano) in northern Italy. White will play in the center, leading to a rich, complicated game. Black's main plan is to find a way to push ...c6–c5. The Modern Meran is a chess game in which both players try to control the other's pawns. The opening of the e-file could be disastrous for Black in a practical game, so he must allow White to capture on e6. Black typically develops his queen with ...Qc7, with the choice to push the c-pawn to c4. The game becomes wildly tactical and provides opportunities for both sides. White can continue 9.0-0 0-0 10.Qc2 Bb7 transposing to one of the topical lines discussed in the Anti-Meran section below. White's strategic idea in the Meran is to push e3–e4, and with a bishop on d6 Black is always ready to meet this with e6–e5. The Anti-Meran Gambit is one of the most popular variations of the game. Black players have tried various approaches to combat White's plan. White can begin the thematic knight transfer immediately with 11.Ng5. Black can respond with 12...a5, and the game could continue with 13.Rb1 axb4 14axb4 Qe7 15.e4 e5. 5...h6 (immediately questioning the white bishop's intentions, leading to Moscow/Anti-Moscow variations) 5...Nbd7 (transposing to the Cambridge Springs Defense), 5...dxc4 (triggering the ultra-sharp Botvinnik Variation) or 5...Be7. Black aims to benefit from slight dark square weaknesses left behind on the queenside after the bishop has moved outside the pawn chain. Botvinnik Variation is probably one of the most complicated of all chess openings, with theory stretching past move thirty in some variations. The opening was introduced by Mikhail Botvinni in the 1945 USSR vs. USA radio match vs. Arnold Denker. The main continuation is 11...Bb7 12.Bg2 Qb6 13.exf6 0-0-0 c5 (14...Ne5 is also an option): White can simply capture 15.dxe5, and while Black wins the queen after 15...Rxd1 16.Raxd1, white seems to have the upper hand at least according to engines. The most challenging continuation is 16.Na4, where Black has two main replies. The first one, although not the best one, is 16...Qa6, leading to another wild and forcing continuation: 17.a3 Bxd5 18.Bxd5 Ne5 19.axb4 Rxd5 20.Qe2 cxb4 21.Nc3. After 5.g3, White makes a claim that he's ready to play the Catalan, with the black pawn a bit passively on c6. This practically forces Black to take the c-pawn with 5...dxc4. White will continue 6.Bg2 (6.a4 c5 is supposed to be good for Black), and Black has now two main choices. First, he can play 6...b5, and the game might continue in Catalan style with 7.Ne5 a6, 8.Nxc6 Qb6, Bb7 and so on. After 7.Qd3, Black's best reply is considered to be 7...a6 8.e4 c4 and 9.dxc5 or 9.e5.",
    "D78": "",
    "D40": "The Queen's Gambit Declined is a chess opening in which Black declines a pawn offered by White. The Orthodox Line can be reached by a number of different move orders, such as 1.d4 Nf6 2.c4 e6 3.Nf3 d5. In the Orthodox Line, the fight for the tempo revolves around White's efforts to play all other useful developing moves. White has several ways of dealing with Black's setup. White has alternatives to 4.Nf3 such as the Marshall Gambit 4.e4; or 4. e3 which may lead to the Stonewall Dutch after ...f5 or transpose to the Semi-Slav. 3...Bb4 (the Accelerated Ragozin[6]), although White has various options to avoid this transposition. The Three Knights Variation of the Queen's Gambit Declined is usually reached from the move order 1.d4 Nf6 2.c4 e6 3.Nf3 d5 4.Nc3, played to avoid the Nimzo-Indian Defense (from the white point of view) The Vienna Variation occurs after Black plays 4...dxc4. An important line in this variation is the Endgame Line. Placing the bishop on Bg5 allows Black to exchange more freely with moves like Nf6-e4. The move Bf4 is designed to restrict Black's opportunities in this way. Play usually continues with 5...0-0 6.e3 c5 7.dxc5 Bxc5. Peter Leko used this variation as White to beat Vladimir Kramnik in their 2004 World Championship Match.",
    "B16": "The Caro–Kann Defence is a chess opening characterised by the moves:1.e4 c6 2.d4 d5 3.Nc3 (or 3.d2) 4.Nxe4 Bf5. The opening is named after Horatio Caro and Marcus Kann, both of whom analysed it in 1886. The Classical Variation is one of the most popular. It is often played with Black castling kingside and even leaving his king in the centre. David Bronstein and Lars Benten have both employed it with some success. More popular are the Modern Variation and the Korchnoi Variation. The Gurgenidze Variation is 1.e4 c6 2.d4 d5 3.Nc3 g6. Black prepares to fianchetto the bishop on g7, creating pressure against White's d4-pawn. After 4.Nf3 Bg7 White usually plays 5.h3 to prevent the ...Bg4 pin. Black's 5...exf6 is regarded as sounder than 5...gxf6!? and offers Black rapid development. The Fantasy Variation, formerly known as the Tartakower or Maroçzy variation, 1.e4 c6 2.d4 d5 3.f3, somewhat resembles the Blackmar–Diemer Gambit. Black's logical and probably best reply is 3...Bg4. The Hillbilly Attack is most often played by weaker players unfamiliar with the Caro–Kann Defence. If 2...d5 3.exd5 cxd5, Black has simply gained a tempo on the bishop. An interesting, relatively unknown try is 1. e4 c6 2. Nf3 d5, sometimes referred to as the Apocalypse Attack. Other lines include 2.d3, the Breyer Variation, 2.b3, and 2.g4. Bronstein–Larsen Variation: 1.e4 c6 2.d4 d5 3.Nc3 g6 4.e5 Bg7 5.f4 h5Campomanes Attack: 1, e4, c6, d5, Nc3, Nf6, Nxf6, exf6.",
    "B29": "The Sicilian Defence is the most commonly used opening in chess. It is based on the opening of 1.e4. Black has three main options after 2.Nf3: 2...d6, 2...Nc6, and 2...e6. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. White's strongest reply is to chase the knight by 3e5 Nc3 and now (a) 4...Nxc3 and (b) 4 ...Nc3. Black's most dangerous try against the Dragon is the Yugoslav Attack, characterised by 6.Be3 Bg7. 2.c3 is the Alapin Variation or c3 Sicilian. Black's best reply is 2...d5 3.exd5 Nf6!, the Tal Gambit. The Grand Prix Attack or McDonnell Attack stems from the 14th match game played in London in 1834. 2.e5 is an eccentric move recently returned to prominence by GM Vadim Zvjaginsev at the 2005 Russian Chess Championship Superfinal. The 2.Qh5, threatening the c-pawn as in the Wayward Queen Attack, was played twice in 2005 by Hikaru Nakamura, but the move is considered dubious. Modern players would consider the notion that the Sicilian \"prevents every attack\" naive.",
    "B20": "The Sicilian Defence is named after Giulio Cesare Polerio, who wrote about it in 1594. Black's c5-pawn is traded for White's d4- pawn in the early stages of the game. It is the most popular and best-scoring response to White's first move 1.e4. Black can then choose between four major variations: the Najdorf, Dragon, Classical and Scheveningen. After 2.Nf3 there are three main options for Black: 2...d6, 2...Nc6, and 2...e6. White's most dangerous try against the Dragon is the Yugoslav Attack, characterised by 6.Be3 Bg7 7.f3 0-0 8.Qd2 Nc6. The Sicilian Defence is one of the most popular openings in chess. The opening is named after the city of Sicilian. The Sicilian defence is based on the 1.e4 and 1.5e4 positions. It is followed by the Najdorf Variation and the Tal Gambit Declined. There are also a number of other openings named after places in the world, s s s. The Pin Variation (also called the Sicilian Counter-Attack) is considered theoretically suspect, but if White is unprepared the tactics can be difficult to calculate at the board. Black's move 2...e6 gives priority to developing the dark-squared bishop. After 3.d4 cxd4 4.Nxd4, Black has three main moves: 4...Nc6 (the Taimanov Variation), 4...a6 ( the Kan Variation) and 4…Nf6.",
    "D76": "",
    "D82": "The Grünfeld Defence is a chess opening characterised by the moves:1. d4 Nf62. c4 g63. Nc3 d5. Black offers White the possibility of 4.cxd5, which may be followed by 4...Nxd5 and 5.e4, giving White an imposing central pawn duo. In classical opening theory this imposing pawn centre was held to give White a large advantage, but the hypermodern school, which was coming to the fore in the 1920s, held that a large pawn centre could be a liability rather than an asset. White can develop their pieces in a number of ways in the Exchange Variation. For decades, theory held that the correct method of  development was with Bc4 and Ne2, often followed by 0-0 and f4–f5, playing for a central breakthrough or kingside attack. In the late 1970s, however, Karpov, Kasparov and others found different methods to play the exchange with White. After 7...Nc6, White will most commonly play 8.Be2, followed by 8...e5! The Grünfeld Gambit is not often met in top-flight play today, its usage having declined significantly since its heyday in the 1930s. In statistical databases this variation shows only a slightly higher percentage of White wins and draws, as opposed to the Exchange Variation. White can accept the gambit by playing 6.cxd5 Nxd5 7.Nxd5 Qxd5 8.Bxc7 or decline it with 6.Qb3 or 6.Rc1, to which Black responds with 6...c5. Chessgames: Neo-Grünfeld 3.f3 is the latest version of the classic 3.g3 game. It is the third version of this game to be released in the U.S. Players can play the game in any of three ways: 1. f3, 2. g3 or 3. g2. The game is available in English, German and Hebrew. It can also be played in any number of ways, such as 2. f2 and 3. f4.",
    "D49": "The Semi-Slav Defense is a variation of the Queen's Gambit Declined chess opening. It is defined by the position reached after the moves: 1.d4 d5 2.c4 c6 3.Nf3 Nf6 4.Nc3 e6ECOD43–D49ParentQueen's Gam bit.ly/SemiSlavDefense. The Meran is a chess variation that takes its name from the town of Meran (Merano) in northern Italy. The Botvinnik Variation is probably one of the most complicated of all chess openings, with theory stretching past move thirty in some variations. The opening was introduced by Mikhail BotVinnik in the 1945 USSR vs USA radio match. Black makes the thematic pawn capture 5...dxc4 as Black defends the center of the center. After 5.g3, White makes a claim that he's ready to play the Catalan. This practically forces Black to take the c-pawn with 5...dxc4. White will continue 6.Bg2 (6.a4 c5 is supposed to be good for Black), and Black has now two main choices. First, he can play 6...b5, and the game might continue in Catalan style with 7.Ne5 a6 8.a 4 (8.Nxc6 Qb6 is fine for Black) Bb7 and so on. After 7.Qd3, Black's best reply is considered to be 7...a. The game ends with a draw at the end of the game.",
    "D85": "The Grünfeld Defence is a chess opening characterised by the moves:1. d4 Nf62. c4 g63. Nc3 d5. Black offers White the possibility of 4.cxd5, which may be followed by 4...Nxd5 and 5.e4. If White does not take the d5-pawn, Black may eventually play ...dxc4, when a White response of e4 again leads to the same pawn structure. In classical opening theory this imposing pawn centre was held to give White a large advantage, but the hypermodern school of chess held that a large pawn centre could be a liability rather than an asset. White can develop their pieces in a number of ways in the Exchange Variation. For decades, theory held that the correct method of  development was with Bc4 and Ne2, often followed by 0-0 and f4–f5, playing for a central breakthrough or kingside attack. In the late 1970s, however, Karpov, Kasparov and others found different methods to play the Exchangevariation with White, often involving an early Rb1. Another, relatively recently developed system involves quickly playing Be3, Qd2 and Rc1 or Rd1. The Grünfeld Gambit is a variation of the Exchange Variation. White can accept the gambit by playing 6.cxd5 Nxd5 7.Nxd5 Qxd5 8.Bxc7, or decline it with 6.Qb3 or 6.Rc1, to which Black responds with 6...c5. In statistical databases, this variation shows only a slightly higher percentage of White wins and draws, as opposed to the Exchange Variant. Systems in which White delays the development Nc3 are known as the Neo-Grünfield Defence. Chessgames: Neo-Grünfeld 3.f3 is a 3.g3 version of the classic chess game. The game is played on the hexagon-shaped board. It is known as the \"Neo-Grunfeld\" version of Chessgames 3. f3 or 3. g3. It can also be played on a hexagon board as 3.e3. For more information, go to: http://www.chessgames.com/neo-grunfeld.",
    "D71": "",
    "B27": "The Sicilian Defence is the most popular and best-scoring response to White's first move 1.e4. The earliest recorded notes on the Sicillian Defence date back to the late 16th century by the Italian chess players Giulio Polerio and Gioachino Greco. Black's most common move after 2.Nf3 is 2...d6 which prepares ...Nf6 to attack the e-pawn without letting White push it to e5. The Sicilian has been practised with 1...K4 at Black's disposal and has been considered the best of the irregular defences to 1...P-K4. Black can then choose between four major variations: the Najdorf, Dragon, Classical and Scheveningen. The Sveshnikov Variation has become very popular in master level chess. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. Black's move 2...e6 gives priority to developing the dark-squared bishop. Black has three main moves: 4...Nc6 (the Taimanov Variation), 4...a6 ( the Kan Variation) and 4...nf6. White's most popular move for White is 5.Bd3. The Sicilian Defence is one of the most popular chess openings. It is named after the Sicilian city of Sveshnikov. There are many other Sicilian openings, but none are as well known as this one.",
    "B18": "The Caro–Kann Defence is a chess opening characterised by the moves:1.e4 c6 2.d4 d5 3.Nc3 (or 3.d2) 4.Nxe4 Bf5. It is named after Horatio Caro and Marcus Kann, both of whom analysed it in 1886. The opening is classified as a Semi-Open Game, like the Sicilian Defence and French Defence. It often leads to good endgames for Black, who has the better pawn structure. The Classical Variation is characterised by the moves: 1.e4 c6 2.d4 d5 3.Nc3 dxe4 4.Nxe4 Nd7. At one time named after the first world champion Wilhelm Steinitz, nowadays the variation is variously referred to as the Smyslov Variation after the seventh world champion Vasily Smyskov. The Karpov Variation, after the twelfth world champion Anatoly Karpv, in whose repertoire it appeared quite often; or the Modern Variation. The Gurgenidze Variation is 1.e4 c6 2.d4 d5 3.Nc3 g6. Black's 5...exf6 is regarded as sounder than 5...gxf6!? of the Bronstein–Larsen Variation. Black prepares to fianchetto the bishop on g7, creating pressure against White's d4-pawn. After 4.Nf3 Bg7 White usually plays 5.h3 to prevent the ...Bg4 pin. The Fantasy Variation, formerly known as the Tartakower or Maroçzy variation, 1.e4 c6 2.d4 d5 3.f3, somewhat resembles the Blackmar–Diemer Gambit. The Two Knights Variation was played by Bobby Fischer in his youth, but has since declined in popularity. Black's logical and probably best reply is 3...Bg4. The Retreat Line 4...Bh5 is playable but Black must be careful. The Hillbilly Attack is most often played by weaker players unfamiliar with the Caro–Kann Defence. An interesting, relatively unknown try is 1. e4 c6 2. Nf3 d5 3. exd5 cxd5 4. Ne5!?, sometimes referred to as the Apocalypse Attack. Other lines include 2.d3, 2.b3, the Euwe Attack, 2b4, the Labahn Attack, and 2.g4. The worst response by white to the Cara-Kann defence is g3. Finnish Variation: 1.e4 c6 2.d4 d5 3.Nc3 g6 4.e5 Bg7 5.f4 h5Campomanes Attack: 1-2.e-e-E-A-F. Bronstein–Larsen Variation. Steinitz Variation, Karpov/Steinitz. Defense. Spassky Variation with 7...Nd7. Tiviakov–Fischer Attack.",
    "A58": "Benko Gambit (or Volga Gambit) is a chess opening characterised by the move 3...b5 in the Benoni Defence. Black sacrifices a pawn for enduring queenside pressure. The idea of sacrificing a pawn with ...b5 and ...a6 is quite old. The name is derived from the Volga River after an article about 3... b5!? by B. Argunow written in Kuibyshev (Samara since 1991), Russia, that was published in 1946 issue of Shakhmaty v SSSR. The Pal Benko Gambit is a chess opening named after a famous player. It is considered to offer Black good practical chances of playing for a win. Many of the world's strongest players have used it at one time or another, including former world champions Viswanathan Anand, Garry Kasparov, Veselin Topalov, and Mikhail Tal. There are various alternatives that avoid some of the problems entailed in the main line. The most popular line is 4...bxc4, the Sosonko Accepted.",
    "A67": "The Benoni Defense, or simply the Benoni, is a chess opening characterized by an early reply of ...c5 against White's opening move 1.d4. In 1825 Aaron Reinganum published a book entitled Ben-Oni oder die Vertheidigungen gegen die Gambitzüge im Schache. Benoni is an ancient Hebrew name, still occasionally used, meaning \"son of my sorrow\". It is a reference to the Biblical account of the dying Rachel giving birth to Benjamin. Benoni is more solid than the Modern Benoni, but also more passive. Black sacrifices a pawn for open lines and long-term positional pressure on the queen's side. Black's intention is to play ...exd5 and create a queenside pawn majority, whose advance will be supported by a fianchettoed bishop on g7. Snake Benoni is a variant where the bishop is developed to d6 rather than g7, and is named after Rolf Olav Martens. Benoni Defense: A65 1.d4 Nf6 2.c4 c5 3.d5 e6 4.Nc3 exd5 5.cxd5 d6 6.e4 g6 7.f4 Bg7 8.Be2 0-0 9.0-0 Re8 10.Nd2 Na6 A79 1. d4 N f 6 2. c4 c4 3. d5 e 6 4. Nc3Exd5 4. cxd5 D6 6 7.e 4 g6 9.Nf3 Bg 7 8. Be2 0 -0 9-0 a6 10.a4 Bb5+Four Pawns Attack: A68 1. Df6 1. c3 c5 2.d6 e6 3. Nf4 C5 3 c4 4. C5 5c4 5c3 5c5 5e4 c6 5cxd4 5e3 6.c3 Exd5 6. e4 g4 7.E4 g5 7.F4 Taimanov Variation.",
    "C55": "The Italian Game is a family of chess openings beginning with the moves:1.e4 e5 2.Nf3 Nc6 3.Bc4ECOC50–C59Origin15th or 16th centuryParentKing's Knight Opening. Black's two main options are 3...Bc5, the Giuoco Piano, and 3...Nf6, the Two Knights Defense. The opening is defined by the development of the white bishop to c4, where it attacks Black's vulnerable f7-square. It is part of the large family of Open Games or Double King's Pawn Games. 3...Nd4 (Blackburne Shilling Gambit) Allows White to attack with 4.d4. 4...exd4 5.c3! (5.Nxd4 and 5.Bg5 are also possible) 5...dxc3 6.Nxc3 Bg7 and now 7.Qb3 (Unzicker) or 7. Bg5 (O'Kelly) 3...g6.  popular in the late 19th and early 20th centuries, but rarely seen today.",
    "E03": "The Catalan Opening is a chess opening where White plays d4 and c4 and fianchettoes the white bishop on g2. The opening was created by Savielly Tartakower at a 1929 tournament in Barcelona. Vladimir Kramnik, Viswanathan Anand and Magnus Carlsen all employ the opening in their World Chess Championship title games. The Open Catalan has been a favorite of Anatoly Karpov and Efim Geller as well as the Tata Steel Chess Tournament. In order to hold the pawn, Black will have to seriously weaken the queenside with ...a6 and ...b5. A4, Ne5, or Qa4+. is a good opening for Black. The Catalan Quality Chess repertoire 1A: 1.d4 The Catalan. Quality Chess is published by Bologan, Victor and Wojo's Weapons: Winning With White; Volume 1. The opening is named after the Catalan city of Barcelona, where the opening is played.",
    "A93": "The Dutch Defence is a chess opening characterised by the moves:1. d4 f5. Black's 1...f5 stakes a claim to the e4-square and envisions an attack in the middlegame on White's kingside. The Dutch has never been a main line against 1.d4 and is rarely seen today in high-level competition. Its most notable use may have been in 1951, when both world champion Mikhail Botvinnik and his challenger, David Bronstein, played it in their 1951 World Championship match. The Staunton Gambit was once a feared attacking line, but it has been out of favour for over 80 years. Carl Mayet introduced a completely different gambit approach to the Dutch in 1839 against von der Lasa, playing 2.h3 followed by 3.g4. Black sometimes starts with the move order 1...e6 to avoid these lines, although Black must then be ready to play the French Defence if White continues 2.e4. The Encyclopaedia of Chess Openings has twenty codes for the Dutch Defence, A80 through A99. A94: 1.d4 f5 2.c4 Nf6 3.g3 e6 4.Bg2 Be7 5.Nf3 0-0 6.0-0 d6 7.Nc3 Qe8 8.Qc2 (Ilyin–Genevsky Variation) A99: 1-1-1 1-2-2 1-3-1. A94-A96-A97-A98-A99. A93-A94-B96-B97-B98-B99.",
    "C99": "The Ruy Lopez is a chess opening named after 16th-century Spanish priest Ruy López de Segura. It is one of the most popular openings, with many variations. White's objective in playing the Ruyopez is to spoil Black's pawn structure. The opening remains the most commonly used amongst the open games in master play. It has been adopted by almost all players during their careers, many of whom have played it with both colours. The most commonly played line is the Closed Defence, which goes 4.Ba4 Nf6 5.0-0 Be7. Black almost always responds 4...dxc6. The Exchange Variation, 4.Bxc6, is considered inferior; the main line runs 7.Re1 d5 8.Nxd4 Bd6! 9.Nxc6 Bxh2+! 10.Kh1! The Berlin and Schliemann Defences are the most popular today, followed by the Classical Defence. Henry Bird played it as Black at least 25 times, scoring +9−13=3 (nine wins, thirteen losses, three draws) The world champion Magnus Carlsen played it in the 2014 Chess Olympiad against Ivan Šarić and lost. The Zaitsev Variation (also called the Flohr–Zaitsevs Variation) was advocated by Igor ZaitSEv, who was one of Karpov's trainers. The Chigorin Variation has declined in popularity because Black must spend some time bringing his offside knight on a5 back into the game. The Pilnik Variation, named for Hermann Pilnik, is also known as the Teichmann Variation. The more common continuation, 10d4, is C94.",
    "A94": "The Dutch Defence is a chess opening characterised by the moves:1. d4 f5. Black's 1...f5 stakes a claim to the e4-square and envisions an attack in the middlegame on White's kingside. The Dutch is an aggressive and unbalancing opening, resulting in the lowest percentage of draws among the most common replies to 1.d4. Its most notable use may have been in 1951, when both world champion Mikhail Botvinnik and challenger David Bronstein played it in their 1951 World Championship match. The Staunton Gambit was once a feared attacking line, but it has been out of favour for over 80 years. Carl Mayet introduced a completely different gambit approach to the Dutch in 1839 against von der Lasa, playing 2.h3 followed by 3.g4. Black sometimes starts with the move order 1...e6 to avoid these lines, although Black must then be ready to play the French Defence if White continues 2.e4. The Encyclopaedia of Chess Openings has twenty codes for the Dutch Defence, A80 through A99. A94: 1.d4 f5 2.c4 Nf6 3.g3 e6 4.Bg2 Be7 5.Nf3 0-0 6.0-0 d6 7.Nc3 Qe8 8.Qc2 (Ilyin–Genevsky Variation) A96: 1:d4. f5, 2. c4, 3. e6, 4. Bg2, 5. Nf3, 6. Nc3, 7.b3 c6 8.Ba3 (Stonewall)",
    "E04": "The Catalan Opening is a chess opening where White plays d4 and c4 and fianchettoes the white bishop on g2. The opening was created by Savielly Tartakower at a 1929 tournament in Barcelona. Vladimir Kramnik, Viswanathan Anand and Magnus Carlsen all used the opening in their World Chess Championship title games. The Open Catalan has been a favorite of Anatoly Karpov and Efim Geller as well as the Tata Steel Chess Tournament in 2022. Black will have to seriously weaken the queenside with ...a6 and ...b5. A4, Ne5, or Qa4+. In order to hold the pawn, Black will need to weaken the queen's side. Kramnik vs. Anand, Wijk aan Zee 2007 1.d4 Nf6 2.c4 e6 3.g3 d5 4.Bg2 Be7 5.Nf3 0-0 6.0-0 dxc4 7.Qc2 a6 8.Qxc4 b5 9.Bb7 10.Bd2 Ra7 11.Rc1 Be4 12.Qb3 Nc6 13.e3 Qa8 14.Qd1 Nb8 15.Ba5 Rc8 16.a3 Bd6 17.Nbd2 Bd5 18.Qf1 Nbd7 19.b4 e5 20.dxe5 Bxe5 21.Nxe5 Nxe5 22.f3 N c4 23.Nxc4 Bxc4 24.e4 c6 26.Rd1 Rd7 27.Rxf4 Nd5 28.Rxd7 Nxd7 28.Qa5 Bxb4 29.Rb1 Qd6 30.Q a4 1–0[3]",
    "C52": "The Italian Game is a family of chess openings beginning with the moves:1.e4 e5 2.Nf3 Nc6 3.Bc4ECOC50–C59 Origin15th or 16th centuryParentKing's Knight Opening. This opening is defined by the development of the white bishop to c4 (the so-called \"Italian bishop\"), where it attacks Black's vulnerable f7-square. Black's two main options are 3...Bc5, the Giuoco Piano, and 3...Nf6, the Two Knights Defense. 3...Nd4 (Blackburne Shilling Gambit) Allows White to attack with 4.d4. 4...exd4 5.c3! (5.Nxd4 and 5.Bg5 are also possible) 5...dxc3 6.Nxc3 Bg7 and now 7.Qb3 (Unzicker) or 7. Bg5 (O'Kelly) 4...Nxe5?! Qg5 is a false gambit expectant upon White falling into the trap of capturing Black's undefended pawn.",
    "A60": "Benoni (or \"Ben-Oni\") is an ancient Hebrew name, still occasionally used, meaning \"son of my sorrow\". It is a reference to the Biblical account of the dying Rachel giving birth to Benjamin. In 1825 Aaron Reinganum, a prominent member of the Frankfurt Jewish community, published a book entitled Ben- Oni oder die Vertheidigungen gegen die Gambitzüge im Schache. In the 1843 Staunton–Saint Amant match, Saint Amant met 1.d4 with 1...c5 in the second and fourth games. Benoni is more solid than the Modern Benoni, but also more passive. Black sacrifices a pawn for open lines and long-term positional pressure on the queen's side. Black may play Nc3, e4, h3, Bd3, Nf3, and g4, in order to gain space on the kingside and prevent ...f5. Black's intention is to play ...exd5 and create a queenside pawn majority, whose advance will be supported by a fianchettoed bishop on g7. Benoni Variation: A65 1.d4 Nf6 2.c4 c5 3.d5 e6 4.Nc3 exd5 5.cxd5 d6 6.e4 g6 7.f4 Bg7 8.Be2 0-0 9.0-0 Re8 10.Nd2 Na6A79 1. d4 NF6 2, c5, 3, d5, e6, g6, cxd5, d6, e4, e5, g4, g5.",
    "A69": "Benoni Defense is a chess opening characterized by an early reply of ...c5 against White's opening move 1.d4. The original form of the Benoni is characterized by 1. d4 c5, now known as the Old Benoni. Black can then offer a pawn sacrifice with 3...b5 (the Benko Gambit), otherwise 3...e6 is the most common move. 3...d6 or 3...g6 are also seen, typically transposing to main lines or to lines of the King's Indian Defense. Benoni is more solid than the Modern Benoni, but also more passive. Black sacrifices a pawn for open lines and long-term positional pressure on the queen's side. Black may play Nc3, e4, h3, Bd3, Nf3, and g4 in order to gain space on the kingside and prevent ...f5. Black's intention is to play ...exd5 and create a queenside pawn majority, whose advance will be supported by a fianchettoed bishop on g7. Benoni: A65 1.d4 Nf6 2.c4 c5 3.d5 e6 4.Nc3 exd5 5.cxd5 d6 6.e4 g6 7.f4 Bg7 8.Be2 0-0 9.0-0 Re8 10.Nd2 Na6A79 1. d4. Nf4 2. c4 3.c5 3d5 4.c3 4.e5 5c3 5c4 5e4 5c6 5c5 5e3 5. e4 5.e6 5.f3 6.E4 6.F4 7.F3 7. F4 8.Nf3 8.Bg7 9.Bb5 9.",
    "C90": "The Ruy Lopez is a chess opening characterised by the moves:1. e4 e52. Nf3 Nc63. Bb5. The opening is named after 16th-century Spanish priest Ruy López de Segura. It is one of the most popular openings, with many variations. Most commonly played third move for Black is the Morphy Defence, 3...a6, a move that forces White to retreat or exchange for Black's knight. Black can answer effectively with 5.d4! exd4 6.e5. White's main continuation is 7.a4 after which Black responds with the typical move 7...Rb8. The main line leads to unbalanced endgames which are difficult to play for both sides, though with a strong drawing tendency. The main line begins with 9.exd5 Nxd5 (9...e4?!, the Herman Steiner variation, is considered weaker) 10.Nxe5 Nxe5 11.Rxe5 c6 (Marshall's original moves, 11...Nf6, and 11...Bb7 are considered inferior, but have also yielded good results for Black) The Pilnik Variation, named for Hermann Pilnik, is also known as the Teichmann Variation. White plays 9.d3 intending to later advance to d4 under favourable circumstances. With 9...Na5 Black chases the white bishop from the a2–g8 diagonal and frees the c-pawn for queenside expansion. The main replies for Black are 4...d6 and 4...Bc5, the latter being more popular.",
    "C64": "The Ruy Lopez is a chess opening characterised by the moves:1. e4 e52. Nf3 Nc63. Bb5. The opening is named after 16th-century Spanish priest Ruy López de Segura. The theory of the Ruyopez is the most extensively developed of all Open Games. Black usually plays 5...f3 to defend the e-pawn, with 5...Qd6, 5...Bg6, or 5...Nf6 preparing the sharp line 5...D6. Black has doubled pawns, but has the bishop pair. White damages Black's pawn structure, gaining a ready-made long-term plan. The most commonly played line is the Closed Defence, which goes 4.Ba4 Nf6 5.0-0 Be7. The Pilnik Variation, named for Hermann Pilnik, is also known as the Teichmann Variation. White plays 9.d3 intending to later advance to d4 under favourable circumstances. The Zaitsev Variation (also called the Flohr–ZaitseV Variation) was advocated by Igor ZaitSev, who was one of Karpov's trainers. Henry Bird played it as Black at least 25 times, scoring +9−13=3 (nine wins, thirteen losses, three draws) The world champion Magnus Carlsen played it in the 2014 Chess Olympiad against Ivan Šarić and lost. The Schliemann Defence is a sharp line in which Black plays for a kingside attack, frequently sacrificing one or two pawns.",
    "A56": "Benoni Defense is a chess opening characterized by an early reply of ...c5 against White's opening move 1.d4. It is named after an ancient Hebrew name, still occasionally used, meaning \"son of my sorrow\" In 1825 Aaron Reinganum published a book entitled Ben-Oni oder die Vertheidigungen gegen die Gambitzüge im Schache. The name \"Benoni\" came to be associated with the opening 1. d4 c5 and other openings in which Black counters d2–d4 with an early ....c7–c5. Benoni is more solid than the Modern Benoni, but also more passive. Black sacrifices a pawn for open lines and long-term positional pressure on the queen's side. Black will look to break with ...b7–b5 or ...f7–f5 after due preparation. White may play Nc3, e4, h3, Bd3, Nf3, and g4, in order to gain space on the kingside and prevent ...f5. Snake Benoni is a variant where the bishop is developed to d6 rather than g7. Benoni Variation: A65 1.d4 Nf6 2.c4 c5 3.d5 e6 4.Nc3 exd5 5.cxd5 d6 6.e4 g6 7.f4 Bg7 8.Be2 0-0 9.0-0 Re8 10.Nd2 Na6 A79 1d4. Nf4 2. c4 3.c5 3d5 4.c3 4.e5 5c3 5c4 5e4 c6 5cxd4 5.e3 5. cxd5 6. e4 g4 7. f4 Taimanov Variation. A65. Benoni:A65. Franco-Benoni Defense.",
    "E32": "The Nimzo-Indian Defence is a chess opening characterised by the moves:1. d4 Nf62 c4 e63. Nc3 Bb4. The hypermodern opening was developed by Aron Nimzowitsch in the early 20th century. It is a highly respected defence to 1.d4 and has been played by every world champion since Capablanca. It can also transpose into lines of the Queen's Gambit or Queen's Indian Defence. Black often sets up a Hedgehog formation (pawns on a6, b6, d6 and e6) while White will try to pursue a strategy of gaining queenside space with b4 and c5. In the Rubinstein, White has often resorted to playing Ne2 rather than Nf3 at some point to be able to recapture on c3 with the knight.",
    "B90-99": "The Sicilian Defence is a chess opening that begins with the following moves:1. e4 c5. The Sicilian is the most popular and best-scoring response to White's first move 1.e4. 17% of all games between grandmasters, and 25% of the games in the Chess Informant database, begin with the Sicilian. It is named after Giulio Cesare Polerio, who wrote about it in 1594. Black's c5-pawn is traded for White's d4-p pawn in the early stages of the game. Black can then choose between four major variations: the Najdorf, Dragon, Classical, and Scheveningen. Black usually plays 6...e6 (ECO B88 transposed) to limit the range of White's bishop. The Sicilian Defence is one of the most popular openings in chess. The opening is named after the city of Sicilian. The Kasparov Gambit 8...d5 was played twice in the World Chess Championship 1985, but virtually disappeared from master praxis after the game Karpov–Van der Wiel, Brussels (SWIFT) 1986. Black's move 2...e6 gives priority to developing the dark-squared bishop. Black has three main moves: 4...Nc6 (the Taimanov Variation), 4...a6 ( the Kan Variation) and 4 ...Nf6. White generally answers with 6.Bd3, supporting the e4-pawn. The Pin Variation (also called the Sicilian Counter-Attack) is considered theoretically suspect, but if White is unprepared the tactics can be difficult to calculate at the board.",
    "E35": "The Nimzo-Indian Defence is a chess opening characterised by the moves:1. d4 Nf62. c4 e63. Nc3 Bb4. In the Encyclopaedia of Chess Openings, it is classified as E20–E59. This hypermodern opening was developed by Aron Nimzowitsch in the early 20th century. It can also transpose into lines of the Queen's Gambit or Queen's Indian Defence. Black's delay in committing to a pawn structure makes it a very flexible defence to 1.d4. 4...0-0 is the most flexible and frequently played response to 4...e5. The Karpov Variation is one of Black's most reliable defences to the Rubinstein System. The Larsen Variation (named after GM Bent Larsen) can be reached by either 7...dxc4 8.Bxc4 Nc6 9.a3 Ba5 or 7...Nc6 8.A3 Bxc3 dxc3 9.bxc3 Qc7 (Main Variation) The Main Variation was enormously popular in the 1950s. After 7...Nc6 8.a3 Bxc3 9.bxc3 dxc4 10.Bxc4 Qc7 is the Khasin Variation, named after International Master Abram Khasin. In the Rubinstein, White has often resorted to playing Ne2 rather than Nf3 at some point to be able to recapture on c3 with the knight, thus avoiding the doubled pawns. The Averbakh Variation (7...Nbd7) was popularized by GMs Viacheslav Ragozin and Yuri A verbakh. Black will try to restrain White's centre as well as they can, ideally blockading it. 4...c5 is one of the most popular moves in chess. The game can still transpose to the main line mentioned above after moves such as 5.Bd3 d5 6.Nf3 0-0 7.0-0. The Hübner Variation was popularized by Bobby Fischer in his world championship match with Boris Spassky in 1972 with great effect in game 5. The Rubinstein Variation is similar in spirit to the Reshevsky Variation: White prevents Black from doubling their pawns. The Classical Fianchetto Variation can be reached through two move orders: 4.e3 b6 5.Bd3 Bb7 6.Nf3 0-0 7.0-0 d5. The Keres Variation is named after Estonian GM Paul Keres, although Smyslov and Bronstein were also early practitioners of this line. Black often sets up a Hedgehog formation (pawns on a6, b6, d6 and e6), while White will try to pursue a strategy of gaining queenside space with b4 and c5. 4...0-0, 4...c5, 4 ...d5, and 4...Nc6 are common replies to 4.Qc2. Black can choose to recapture on c5 with the bishop (e.g. 5...Bxc5) or with the knight (after 5...Na6 or 6.Nf3 Na6) White almost always plays 5.dxc5. The Pirc Variation was not popular during the mid-20th century. It was the discovery of 12.Qd2! which revived this line for White. 4...Nc6 is the Zürich or Milner-Barry Variation. Black gives up the dark-squared bishop, but places their central pawns on d6 and e5 so that their remaining bishop is unimpeded. 4...d5 transposes to the Ragozin Defence of the Queen's Gambit Declined and 4...b6. The Nimzo/Queen's Indian hybrid line is the most common move that stays within Nimzo-Indian territory. After 6.Nf3 Qf5 7.Qxf5 exf5, Black strengthens his grip on e4 and makes e6 available for the bishop.",
    "A51": "The Budapest Gambit is a chess opening that begins with the moves:1. d4 Nf62. c4 e5. The first known game with the gambit is Adler–Maróczy (played in Budapest in 1896) It enjoyed a rise in popularity in the early 1920s, but nowadays is rarely played at the top level. It experiences a lower percentage of draws than other main lines, but also a lower overall performance for Black. Black usually looks to have an aggressive game or cripple White's pawn structure. Black can easily get several pieces around the white king, notably a rook to h6, a queen to h4 and a knight on g4. The game will take an entirely different structure depending on whether Black gives up the bishop pair or tries to keep it. The Budapest Gambit is a move that involves pawn advances on the queenside. Black can then force mate in 8 moves by winning this weak pawn. The Gambit can be played in a variety of ways, including the Exchange Variation of the French Defence, the Rubinstein line, and the Ra8–a8 manoeuvre. It is called the \"soul of the game\" and is played by GMs Wu Shaobin and Ashot Nadanian. It has been described as the \"most difficult game in chess\" to master. Black mates with either 31.Kf5 g6+ 32.KF6 Bd4 mate, or 31. Kf3 Rf2 mate. The Budapest gambit was referenced in season 28, episode 15, of The Simpsons, in an episode called \"The Cad and the Hat\"",
    "C63": "The Ruy Lopez is a chess opening characterised by the moves:1. e4 e52. Nf3 Nc63. Bb5. The opening is named after 16th-century Spanish priest Ruy López de Segura. It is one of the most popular openings, with many variations. The Morphy Defence is the most common Black move after 3...a6. White's objective in playing the Ruyopez is to spoil Black's pawn structure. It was included in the Göttingen manuscript, which dates from c. 1490. The most commonly played line is the Closed Defence, which goes 4.Ba4 Nf6 5.0-0 Be7. Black almost always responds 4...dxc6. The Pilnik Variation, named for Hermann Pilnik, is also known as the Teichmann Variation. White plays 9.d3 intending to later advance to d4 under favourable circumstances. With 9...Bb7 Black prepares to put more pressure on e4 after 10.d4 Re8. The Berlin and Schliemann Defences are the most popular today, followed by the Classical Defence. Henry Bird played it as Black at least 25 times, scoring +9−13=3 (nine wins, thirteen losses, three draws) The world champion Magnus Carlsen played it in the 2014 Chess Olympiad against Ivan Šarić and lost. White's most important continuations after 4...Bc5 are 5.0-0, 5.Bxc6, and 5.c3.",
    "C97": "The Ruy Lopez is a chess opening characterised by the moves:1. e4 e52. Nf3 Nc63. Bb5. It is named after 16th-century Spanish priest Ruy López de Segura. Most commonly played third move for Black is the Morphy Defence, 3...a6, a move that forces White to retreat or exchange for Black's knight. The theory of the Ruyopez is the most extensively developed of all Open Games. The most commonly played line is the Closed Defence, which goes 4.Ba4 Nf6 5.0-0 Be7. Black almost always responds 4...dxc6. In the Worrall Attack (ECO C86), White replaces 6.Re1 with 6.Qe2. The Breyer Variation was recommended by Gyula Breyer as early as 1911. Boris Spassky has a career-plus score with the Breyer. The main line continues 10d4 Nbd7 11Nbd2 12.a4, 12.d5, 12b4, or the main line 12.Bb7 or ...Bd7. The Steinitz Defence (3...d6) is solid but passive and cramped. Henry Bird played it as Black at least 25 times, scoring +9−13=3 (nine wins, thirteen losses, three draws) The world champion Magnus Carlsen played it in the 2014 Chess Olympiad against Ivan Šarić and lost. The Classical Defence or Cordel Defence (ECO C64), 3...Bc5 is possibly the oldest defence to the Ruy Lopez.",
    "E61": "The Indian Game is a British breed of game chicken. It is a heavy, muscular bird with an unusually broad breast. It was developed by Sir Walter Gilbert, of Bodmin in Cornwall, in about 1820. In the United States the name was changed in the early twentieth century to Cornish. A white variant, the White Cornish, was developed there at about the same time, and is much used in modern industrial chicken meat production in many parts of the world. The Indian Game was bred as a gamecock, but was not successful as a fighting bird.",
    "C37": "",
    "A05": "The King's Indian Attack is a chess opening system where White adopts the setup more commonly seen being played by Black in the King'sIndian Defence. The King's India Attack is characterised by the following moves: the central pawns are developed to e4 and d3, the knights are develop to d2 and f3, and White castles kingside. It is a closed, strategic opening that presents its practitioner with common themes and tactics and a comfortable middlegame against various defences. Black's strategy differs from standard French Defence lines because the e5-pawn will be defended by pieces rather than pawns. After 1.e4 e6, the game might typically proceed as follows: 4.Ngf3 Nf6 5.g3 Nc6 6.Bg2 Be7 7.0-0 0-0 8.Re1 (see diagram in previous section) White will now look to play e4–e5, cramping Black, and then proceed with moves such as Nf1, Bf4, Qe2, h4, N1h2 (or Ne3), h5, g4 (or Ng4) The Kings Indian Attack setup is also sometimes employed against the Caro–Kann Defence. Maddox, Don (2002): Königsindischer Angriff - Schach Training, Hamburg: ChessBase GmbH, ISBN 3-935602-51-0New In Chess Yearbook (1998): King's Indian Attack: Black castles kingside, Alkmaar: Interchess BV, Vol. 49, ISBN-90-5691-044-2, p. 186-190.Norwood, David (1991): King’s Indian Attack, London: Trends Publications, without ISBNSchiller, Eric (1989): How To Play The Kings Indian attack, Moon Township: Chess Enterprises, ISBN  0-931462-95-9Tangborn, Eric. (1992): A Fischer Favorite: The King'sIndian Attack – with 46 fully annotated Games, o.O.: International Chess Enterprises,. ISBN 1-879479-07-9.",
    "E95": "",
    "C08": "The French Defence is a chess opening characterised by the moves:1.e4 e6, 2.d4 d5, 3.Nc3 or 3.e5. Black usually plays ...c5 soon after, attacking White's pawn centre and gaining space on the queenside. The French has a reputation for solidity and resilience, although some lines such as the Winawer Variation can lead to sharp complications. Black's natural French Defence move 6...c5 runs into 7.Bxe7 when Black must either move the king with 7...Kxe7 or allow 7...Qxe7. The McCutcheon Variation is named for John Lindsay McCutheon of Philadelphia (1857–1905), who brought the variation to public attention when he used it to defeat World Champion Steinitz in a simultaneous exhibition in Manhattan in 1885. The Advance Variation is frequently played in the early days of the French Defence. It has the reputation of giving immediate equality to Black due to the symmetrical pawn structure. The Encyclopaedia of Chess Openings includes an alphanumeric classification system for openings that is widely use.  briefly experimented with it before switching to 3.Nc3. It is also known as the Black Variation and the White Variation, and has been used in a number of chess games since the early 1980s. It can be played in any of the following positions: A, B, C, D, E, F, G, H, I, J, K, R, S, T, U, W, Z, Z.",
    "E92": "The King's Indian Defence (or KID) is a common chess opening. It is defined by the following moves:1. d4 Nf62. c4 g6. Black intends to follow up with 3...Bg7 and 4...d6 (the Grünfeld Defence arises when Black plays 3...d5 instead and is considered a separate opening) White's major third move options are 3.Nc3, 3.nf3 or 3.g3. Black stakes out their own claim to the centre with the Benoni-style ...c5. 7.0-0 Na6 has seen some popularity recently. The purpose of this move is to transfer the knight to c5 after White's eventual d5. After 7...a5 White plays 8.Bg5 to pin the knight, making it harder for Black to achieve the ...f7–f5 break. In the Exchange Variation (7.dxe5 dxe5 8.Qxd8 Rxd8), White exchanges queens and is content to play for a small, safe advantage in relatively quiet positions. The Sämisch Variation is 3.Nc3 Bg7 4.e4 d6 5.f3. Black has a variety of pawn breaks, such as ...e5, ...c5 and ...b5 (prepared by ...c6 and/or ...a6) This can transpose to the Modern Benoni after 5...0-0 6.Bg5 c5 7.d5 e6. Black can strike for the centre as previously mentioned or delay with 6...Nc6, 7...a6 and 8...Rb8. The Averbakh Variation is 3.Nc3 Bg7 4.e4 d6 5.Be2 0-0 6.Bg5. The Fianchetto Variation 1.d4 Nf6 2.c4 g6 3. nf3 Bf3 4.g3 0-1 5.bg2 d6 6.0-0 is named for White's development of light-squared bishop to g2. The Four Pawns Attack is the most aggressive method for White. White has other setups, such as Nf3 and h3 and Nge2 (with or without Bd3), but these are currently not as popular at the grandmaster level. 1.d4 Nf6 2.c4 g6 3.Nc3 Bg7 4.e4 d6 5.Nge2 followed by 6.Ng3 is called the Hungarian Attack. One of the most famous King's Indian games was a brilliancy by the late Ukrainian-American grandmaster Eduard Gufeld, who called it his \"Mona Lisa\" E86 King's Indian, Sämisch, Orthodox, 7.Nge2 c6E87 King's Iraqi, SÜmisch,. Orthodox,7.d5 c6, 7...Nbd7, 8.Re1, Main line. E90 King's Indians, 5.Nf3, Kazakh variation, 6.Be2, Classical Variation. E93 King's India, Petrosian system, Main lines. E94 King'sIndian, Orthodox Variation, 7 Nbd 7. Re1. E97 King's Hindu, Orthodox. Aronin–Taimanov Variation (Yugoslav Attack / Mar del Plata Variation)",
    "A02": "Bird's Opening is a standard flank opening. It is named after 19th century English player Henry Bird. Black may challenge White's plan to control e5 immediately by playing From's Gambit (1...e5) The opening was mentioned by Luis Ramírez de Lucena in his book Repetición de Amores y Arte de Ajedrez con Cien Juegos de Partido, published c. 1497. It was sometimes played by La Bourdonnais and Elijah Williams in the mid-nineteenth century. International Master (IM) Timothy Taylor recommends 3.Nc3! Nxe5 4.d4 intending 5.e4, rather than 3.nf3?! g5! when Black stands well. Emanuel Lasker introduced 4...g5 in the game Bird–Lasker, Newcastle upon Tyne, 1892. White has a large advantage in all lines, although play remains extremely sharp, e.g. 13...Rde8 14.Nd2 14.Kd1 Bxh2 16.exf5! Re8 17.fxg6! Qxe3 18.Qxe3 Rxe3 19.gxf7; or 13...Bd7 (threatening 14...Rxh 2!) 14.Bf2! The offbeat 1...b6!? is also known, and more soundly based than the same move after 1.e4 or 1.d4. The Swiss Gambit was named by Alexander Wagner (1868–1942), a Polish chess player and openings analyst who introduced it in the Swiss correspondence game Wagner–Kostin, 1910–11. Another offbeat try is Martin Appleberry's 1...Nh6!?, also known as the Horsefly, which exploits the closed c1-h6 diagonal. 1.f4 ranks sixth in popularity in Chessgames.com's database, behind 1.e4, 1.d4,1.Nf3, 1,c4, and 1.g3. It is less than one-twentieth as popular as the mirror image English Opening (1.c4) The move slightly weakens White's king's position. Black's most successful response to Bird's Opening in that rating range is e5, where Black's win percentage is 50-46%, but that evens to 48-48% when White plays 2.fxe5. Chess is a popular game of chess. Chess tournaments include the Chess Olympiad, the Chess World Cup and the Chess Grand Prix. Chess is popular in the arts, literature and the sciences. Chess has its roots in ancient Persia and medieval Europe. Chess was first played in Germany in the 17th century. It is still played today in Germany and other European countries. Chess can be played in many different ways, including the traditional two-knights defense and the two-pawn defence.",
    "C30": "The King's Gambit is a chess opening that begins with the moves:1.e4 e5 2.f4. It was one of the most popular openings until the late 19th century, when improvements in defensive technique led to its decline in popularity. It is infrequently seen at master level today, as Black has several methods to obtain equality, but is still popular at amateur level. In 2012, an April Fools' Day prank by Chessinventor Ryik Rajlich claimed to have proven to a 99.9999% certainty that a draw is at best possible. The main continuations for White are 3.Nf3 (King's Knight's Gambit) and 3.Bc4 (Bishop'sGambit) Black usually accepts the gambit pawn. The Classical Defense (2...Bc5) and the Falkbeer Countergambit are also popular. Black may play safely with 6...Nh6 (Silberschmidt Variation or counter-sacrifice) after 5h4 d6 or the Philidor Gambit after 4...Bg7. The Quaade Gambit (3.Nf3 g5 4.Nc3) is named after a Danish amateur who discussed it in correspondence with the Deutsche Schachzeitung in the 1880s. The move has received renewed attention following its recommendation by John Shaw in his 2013 book on the King's Gambit. A well-known trap here is 4...g4 5.Ne5 Qh4+ 6.g3 fxg3 7.Qxg4 g2+? The Fischer Defense (3.Nf3 d6), although previously known, was advocated by Bobby Fischer after he was defeated by Boris Spassky in a Kieseritzky Gambit at the 1960 Mar del Plata tournament. The Abbazia Defense has much the same idea as the Falkbeer Countergambit, and can in fact be reached via transposition, i.e. 2...d5 3.exd5 exf4 4. nf3. The Bishop's Gambit is the most important. Black's other main option is 3...d5, returning the pawn immediately. John Shaw wrote that 3...Nc6 is a \"refutation\" of the Bishop's Gambit, as he says that Black is better in all variations. The Falkbeer Countergambit is named after the 19th-century Austrian master Ernst Falkbeer. It runs 1.e4 e5 2.f4 d5 3.exd5 e4, in which Black sacrifices a pawn in return for quick and easy development. The King's Gambit is one of the oldest countergambits in Chess. It is considered dubious because 3.exf5 with the threat of Qh5+ gives White a good game. The variation is sometimes named the Pantelidakis Countergambit because GM Larry Evans answered a question about it in Chess Life and Review. White may also offer the gambit in the Bishop's Opening, e.g. 1.e4 e5 2.Nc3 Nc6 3.f4, though this is uncommon."
}